#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_dataflow_flex_template_job.flex_template_job will be created
  + resource "google_dataflow_flex_template_job" "flex_template_job" {
      + additional_experiments       = (known after apply)
      + container_spec_gcs_path      = "gs://prod-im-data-imx-resource/dataflow-templates/blockchain-etl-dataflow/metadata.json"
      + id                           = (known after apply)
      + job_id                       = (known after apply)
      + name                         = (known after apply)
      + on_delete                    = "drain"
      + parameters                   = {
          + "allowedTimestampSkewSeconds" = "1814400"
          + "chainConfigFile"             = "/template/blockchain_zkevm_imtbl_testnet_13392_prod.json"
          + "diskSizeGb"                  = "30"
          + "enableStreamingEngine"       = "true"
          + "gcpTempLocation"             = "gs://prod-im-data-imx-resource/ethereum-etl/temp"
          + "maxNumWorkers"               = "1"
          + "project"                     = "prod-im-data"
          + "region"                      = "us-central1"
          + "runner"                      = "DataflowRunner"
          + "tempLocation"                = "gs://prod-im-data-imx-resource/ethereum-etl/temp"
          + "workerMachineType"           = "n1-standard-1"
          + "zone"                        = "us-central1-a"
        }
      + project                      = "prod-im-data"
      + region                       = "us-central1"
      + service_account_email        = (known after apply)
      + skip_wait_on_job_termination = true
      + staging_location             = (known after apply)
      + state                        = (known after apply)
      + temp_location                = (known after apply)
      + type                         = (known after apply)
    }

  # google_storage_bucket_object.blockchain_etl_dataflow will be created
  + resource "google_storage_bucket_object" "blockchain_etl_dataflow" {
      + bucket         = "prod-im-data-imx-resource"
      + content        = (sensitive value)
      + content_type   = "application/json"
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "dataflow-templates/blockchain-etl-dataflow/metadata.json"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + storage_class  = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @roopak-immutable, Action: `pull_request`, Workflow: `Deploy blockchain etl datafow into GCP`*